In [1]:
import pandas as pd

In [31]:
data = pd.read_csv('data.csv', encoding = 'ISO-8859-1')
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [33]:
data.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [35]:
data.query('Quantity == -80995')

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
540422,C581484,23843,"PAPER CRAFT , LITTLE BIRDIE",-80995,12/9/2011 9:27,2.08,16446.0,United Kingdom

In [36]:
data.query('Quantity == 80995')

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
540421,581483,23843,"PAPER CRAFT , LITTLE BIRDIE",80995,12/9/2011 9:15,2.08,16446.0,United Kingdom

In [37]:
data.query('UnitPrice == -11062.06')

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
299983,A563186,B,Adjust bad debt,1,8/12/2011 14:51,-11062.06,NaN,United Kingdom
299984,A563187,B,Adjust bad debt,1,8/12/2011 14:52,-11062.06,NaN,United Kingdom

In [56]:
data.query('UnitPrice == 38970')

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
222681,C556445,M,Manual,-1,6/10/2011 15:31,38970.0,15098.0,United Kingdom

In [52]:
data.query("Description == 'Adjust bad debt'")

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
299982,A563185,B,Adjust bad debt,1,8/12/2011 14:50,11062.06,NaN,United Kingdom
299983,A563186,B,Adjust bad debt,1,8/12/2011 14:51,-11062.06,NaN,United Kingdom
299984,A563187,B,Adjust bad debt,1,8/12/2011 14:52,-11062.06,NaN,United Kingdom

In [53]:
data.query("Description == 'Manual'")

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
2239,536569,M,Manual,1,12/1/2010 15:35,1.25,16274.0,United Kingdom
2250,536569,M,Manual,1,12/1/2010 15:35,18.95,16274.0,United Kingdom
5684,536865,M,Manual,1,12/3/2010 11:28,2.55,NaN,United Kingdom
6798,536981,M,Manual,2,12/3/2010 14:26,0.85,14723.0,United Kingdom
7976,537077,M,Manual,12,12/5/2010 11:59,0.42,17062.0,United Kingdom
...,...,...,...,...,...,...,...,...
531432,580956,M,Manual,4,12/6/2011 14:23,1.25,17841.0,United Kingdom
533082,C581009,M,Manual,-1,12/7/2011 9:15,125.00,16971.0,United Kingdom
534308,C581145,M,Manual,-1,12/7/2011 13:48,9.95,17490.0,United Kingdom
538321,581405,M,Manual,3,12/8/2011 13:50,0.42,13521.0,United Kingdom
541541,C581499,M,Manual,-1,12/9/2011 10:28,224.69,15498.0,United Kingdom

In [60]:
data['Description'].value_counts()

WHITE HANGING HEART T-LIGHT HOLDER     2369
REGENCY CAKESTAND 3 TIER               2200
JUMBO BAG RED RETROSPOT                2159
PARTY BUNTING                          1727
LUNCH BAG RED RETROSPOT                1638
                                       ...
mouldy                                    1
Sale error                                1
sold as set by dotcom                     1
PINK MARSHMALLOW SCARF KNITTING KIT       1
missing?                                  1
Name: Description, Length: 4223, dtype: int64

In [ ]:
data.pivot_table()

In [39]:
def outliers(x, y, z):
    """ 
    Функция определяющая выбросы в DataFrame, где 1-ый аргумент - DataFrame, к которому применятеся функция, 
    2-ой аргумент - столбец, в котором осуществляется поиск выбросов,
    3-ий аргумент - изменяет результат работы функции: если поставить 0, то возвращаются ячейки с выбросами, 
    если 1, то возвращаются все ячейки, за исключением выбросов и ячеек, в которых в данном столбце стоит NaN. 
    
    """
    q1 = x[y].quantile(0.25)
    q3 = x[y].quantile(0.75)
    iqr = q3 - q1
    lower_bound = q1 - (1.5 * iqr) 
    upper_bound = q3 + (1.5 * iqr)

# remove_outliers = horse_8col[horse_8col['pulse'].between(lower_bound, upper_bound, inclusive=True)]

    outliers_low = x[x[y] < lower_bound]
    outliers_up = x[x[y] > upper_bound]
    outliers_concat = pd.concat([outliers_low, outliers_up])
    
    remove_outliers = x[x[y].between(lower_bound, upper_bound, inclusive=True)]
    
    if z == 0:
        return outliers_concat
    else:
        return remove_outliers

In [95]:
data_1 = outliers(data, 'UnitPrice', 0)
data_1

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
299983,A563186,B,Adjust bad debt,1,8/12/2011 14:51,-11062.06,NaN,United Kingdom
299984,A563187,B,Adjust bad debt,1,8/12/2011 14:52,-11062.06,NaN,United Kingdom
16,536367,22622,BOX OF VINTAGE ALPHABET BLOCKS,2,12/1/2010 8:34,9.95,13047.0,United Kingdom
45,536370,POST,POSTAGE,3,12/1/2010 8:45,18.00,12583.0,France
65,536374,21258,VICTORIAN SEWING BOX LARGE,32,12/1/2010 9:09,10.95,15100.0,United Kingdom
...,...,...,...,...,...,...,...,...
541768,581578,POST,POSTAGE,3,12/9/2011 12:16,18.00,12713.0,Germany
541786,581578,22622,BOX OF VINTAGE ALPHABET BLOCKS,6,12/9/2011 12:16,11.95,12713.0,Germany
541831,581579,22941,CHRISTMAS LIGHTS 10 REINDEER,4,12/9/2011 12:19,8.50,17581.0,United Kingdom
541849,581580,22894,TABLECLOTH RED APPLES DESIGN,2,12/9/2011 12:20,9.95,12748.0,United Kingdom
541892,581586,21217,RED RETROSPOT ROUND CAKE TINS,24,12/9/2011 12:49,8.95,13113.0,United Kingdom

In [81]:
data_1 = data.groupby(['CustomerID','StockCode']).sum()
data_1

                      Quantity  UnitPrice
CustomerID StockCode
12346.0    23166             0       2.08
12347.0    16008            24       0.25
           17021            36       0.30
           20665             6       2.95
           20719            40       3.40
...                        ...        ...
18287.0    84920             4       3.75
           85039A           96       2.90
           85039B          120       4.55
           85040A           48       3.30
           85173            48       1.69

[267615 rows x 2 columns]

In [83]:
data_1[data_1.Quantity == 0]

                      Quantity  UnitPrice
CustomerID StockCode
12346.0    23166             0       2.08
12352.0    M                 0    1680.60
12359.0    22839             0      29.90
12362.0    22941             0      17.00
           22942             0      17.00
...                        ...        ...
18274.0    23243             0       9.90
           23245             0       9.90
           84509A            0       7.50
           84988             0       2.90
18276.0    23401             0      18.75

[1503 rows x 2 columns]

In [92]:
data.sort_values(['StockCode', 'UnitPrice'], ascending=False)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
40383,539736,m,Manual,1,12/21/2010 15:18,2.55,NaN,United Kingdom
42057,539958,gift_0001_50,Dotcomgiftshop Gift Voucher £50.00,1,12/23/2010 13:26,42.55,NaN,United Kingdom
178556,552232,gift_0001_50,Dotcomgiftshop Gift Voucher £50.00,1,5/6/2011 15:54,41.67,NaN,United Kingdom
239744,558066,gift_0001_50,Dotcomgiftshop Gift Voucher £50.00,1,6/24/2011 15:45,41.67,NaN,United Kingdom
245516,558614,gift_0001_50,Dotcomgiftshop Gift Voucher £50.00,1,6/30/2011 15:56,41.67,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
143930,548714,10002,INFLATABLE POLITICAL GLOBE,2,4/3/2011 15:07,0.85,17337.0,United Kingdom
158070,550272,10002,INFLATABLE POLITICAL GLOBE,62,4/15/2011 12:14,0.85,18079.0,United Kingdom
160128,550452,10002,INFLATABLE POLITICAL GLOBE,1,4/18/2011 12:56,0.85,14525.0,United Kingdom
139083,548286,10002,NaN,180,3/30/2011 11:47,0.00,NaN,United Kingdom
171573,551429,10002,NaN,-3,4/28/2011 15:05,0.00,NaN,United Kingdom

#define a list to store duplicates index
dups=[]

#apply conditions to locate rows to be removed.
data.apply(lambda x: dups.extend(data.loc[(data.StockCode==x.StockCode)&(data.Quantity+x.Quantity==0)&(data.UnitPrice+x.UnitPrice==0)].index.tolist()), axis=1)

#filter results based on dups ID
data.loc[~data.index.isin(dups)]

In [ ]:
data.info()